betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_can.c
    /* Init the low level hardware: CLOCK, NVIC */
    hcan->MspInitCallback(hcan);
  }

#else
  if (hcan->State == DAL_CAN_STATE_RESET)
  {
    /* Init the low level hardware: CLOCK, NVIC */
    DAL_CAN_MspInit(hcan);
  }
#endif /* (USE_DAL_CAN_REGISTER_CALLBACKS) */

  /* Request initialisation */
  SET_BIT(hcan->Instance->MCTRL, CAN_MCTRL_INITREQ);

  /* Get tick */
  tickstart = DAL_GetTick();

  /* Wait initialisation acknowledge */
  while ((hcan->Instance->MSTS & CAN_MSTS_INITFLG) == 0U)
  {
    if ((DAL_GetTick() - tickstart) > CAN_TIMEOUT_VALUE)
    {
      /* Update error code */
      hcan->ErrorCode |= DAL_CAN_ERROR_TIMEOUT;

      /* Change CAN state */
      hcan->State = DAL_CAN_STATE_ERROR;

      return DAL_ERROR;
    }
  }

  /* Exit from sleep mode */
  CLEAR_BIT(hcan->Instance->MCTRL, CAN_MCTRL_SLEEPREQ);

  /* Get tick */
  tickstart = DAL_GetTick();

  /* Check Sleep mode leave acknowledge */
  while ((hcan->Instance->MSTS & CAN_MSTS_SLEEPFLG) != 0U)
  {
    if ((DAL_GetTick() - tickstart) > CAN_TIMEOUT_VALUE)
    {
      /* Update error code */
      hcan->ErrorCode |= DAL_CAN_ERROR_TIMEOUT;

      /* Change CAN state */
      hcan->State = DAL_CAN_STATE_ERROR;

      return DAL_ERROR;
    }
  }

  /* Set the automatic bus-off management */
  if (hcan->Init.AutoBusOff == ENABLE)
  {
    SET_BIT(hcan->Instance->MCTRL, CAN_MCTRL_ALBOFFM);
  }
  else
  {
    CLEAR_BIT(hcan->Instance->MCTRL, CAN_MCTRL_ALBOFFM);
  }

  /* Set the automatic wake-up mode */
  if (hcan->Init.AutoWakeUp == ENABLE)
  {
    SET_BIT(hcan->Instance->MCTRL, CAN_MCTRL_AWUPCFG);
  }
  else
  {
    CLEAR_BIT(hcan->Instance->MCTRL, CAN_MCTRL_AWUPCFG);
  }

  /* Set the automatic retransmission */
  if (hcan->Init.AutoRetransmission == ENABLE)
  {
    CLEAR_BIT(hcan->Instance->MCTRL, CAN_MCTRL_ARTXMD);
  }
  else
  {
    SET_BIT(hcan->Instance->MCTRL, CAN_MCTRL_ARTXMD);
  }

  /* Set the receive FIFO locked mode */
  if (hcan->Init.ReceiveFifoLocked == ENABLE)
  {
    SET_BIT(hcan->Instance->MCTRL, CAN_MCTRL_RXFLOCK);
  }
  else
  {
    CLEAR_BIT(hcan->Instance->MCTRL, CAN_MCTRL_RXFLOCK);
  }

  /* Set the transmit FIFO priority */
  if (hcan->Init.TransmitFifoPriority == ENABLE)
  {
    SET_BIT(hcan->Instance->MCTRL, CAN_MCTRL_TXFPCFG);
  }
  else
  {
    CLEAR_BIT(hcan->Instance->MCTRL, CAN_MCTRL_TXFPCFG);
  }

  /* Set the bit timing register */
  WRITE_REG(hcan->Instance->BITTIM, (uint32_t)(hcan->Init.Mode           |
                                            hcan->Init.SyncJumpWidth  |
                                            hcan->Init.TimeSeg1       |
                                            hcan->Init.TimeSeg2       |
                                            (hcan->Init.Prescaler - 1U)));

  /* Initialize the error code */
  hcan->ErrorCode = DAL_CAN_ERROR_NONE;

  /* Initialize the CAN state */
  hcan->State = DAL_CAN_STATE_READY;

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Deinitializes the CAN peripheral registers to their default
  *         reset values.
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_CAN_DeInit(CAN_HandleTypeDef *hcan)
{
  /* Check CAN handle */
  if (hcan == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_CAN_ALL_INSTANCE(hcan->Instance));

  /* Stop the CAN module */
  (void)DAL_CAN_Stop(hcan);

#if USE_DAL_CAN_REGISTER_CALLBACKS == 1
  if (hcan->MspDeInitCallback == NULL)
  {
    hcan->MspDeInitCallback = DAL_CAN_MspDeInit; /* Legacy weak MspDeInit */
  }

  /* DeInit the low level hardware: CLOCK, NVIC */
  hcan->MspDeInitCallback(hcan);

#else
  /* DeInit the low level hardware: CLOCK, NVIC */
  DAL_CAN_MspDeInit(hcan);
#endif /* (USE_DAL_CAN_REGISTER_CALLBACKS) */

  /* Reset the CAN peripheral */
  SET_BIT(hcan->Instance->MCTRL, CAN_MCTRL_SWRST);

  /* Reset the CAN ErrorCode */
  hcan->ErrorCode = DAL_CAN_ERROR_NONE;

  /* Change CAN state */
  hcan->State = DAL_CAN_STATE_RESET;

  /* Return function status */
  return DAL_OK;
}

/**
  * @brief  Initializes the CAN MSP.
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval None
  */
__weak void DAL_CAN_MspInit(CAN_HandleTypeDef *hcan)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hcan);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_CAN_MspInit could be implemented in the user file
   */
}

/**
  * @brief  DeInitializes the CAN MSP.
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval None
  */
__weak void DAL_CAN_MspDeInit(CAN_HandleTypeDef *hcan)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hcan);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the DAL_CAN_MspDeInit could be implemented in the user file
   */
}

#if USE_DAL_CAN_REGISTER_CALLBACKS == 1
/**
  * @brief  Register a CAN CallBack.
  *         To be used instead of the weak predefined callback
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for CAN module
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *           @arg @ref DAL_CAN_TX_MAILBOX0_COMPLETE_CB_ID Tx Mailbox 0 Complete callback ID
  *           @arg @ref DAL_CAN_TX_MAILBOX1_COMPLETE_CB_ID Tx Mailbox 1 Complete callback ID
  *           @arg @ref DAL_CAN_TX_MAILBOX2_COMPLETE_CB_ID Tx Mailbox 2 Complete callback ID
  *           @arg @ref DAL_CAN_TX_MAILBOX0_ABORT_CB_ID Tx Mailbox 0 Abort callback ID
  *           @arg @ref DAL_CAN_TX_MAILBOX1_ABORT_CB_ID Tx Mailbox 1 Abort callback ID
  *           @arg @ref DAL_CAN_TX_MAILBOX2_ABORT_CB_ID Tx Mailbox 2 Abort callback ID
  *           @arg @ref DAL_CAN_RX_FIFO0_MSG_PENDING_CB_ID Rx Fifo 0 message pending callback ID
  *           @arg @ref DAL_CAN_RX_FIFO0_FULL_CB_ID Rx Fifo 0 full callback ID
  *           @arg @ref DAL_CAN_RX_FIFO1_MSG_PENDING_CB_ID Rx Fifo 1 message pending callback ID
  *           @arg @ref DAL_CAN_RX_FIFO1_FULL_CB_ID Rx Fifo 1 full callback ID
  *           @arg @ref DAL_CAN_SLEEP_CB_ID Sleep callback ID
  *           @arg @ref DAL_CAN_WAKEUP_FROM_RX_MSG_CB_ID Wake Up from Rx message callback ID
  *           @arg @ref DAL_CAN_ERROR_CB_ID Error callback ID
  *           @arg @ref DAL_CAN_MSPINIT_CB_ID MspInit callback ID
  *           @arg @ref DAL_CAN_MSPDEINIT_CB_ID MspDeInit callback ID
  * @param  pCallback pointer to the Callback function
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_CAN_RegisterCallback(CAN_HandleTypeDef *hcan, DAL_CAN_CallbackIDTypeDef CallbackID, void (* pCallback)(CAN_HandleTypeDef *_hcan))
{
  DAL_StatusTypeDef status = DAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hcan->ErrorCode |= DAL_CAN_ERROR_INVALID_CALLBACK;

    return DAL_ERROR;
  }

