betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_can.c
      case DAL_CAN_MSPINIT_CB_ID :
        hcan->MspInitCallback = DAL_CAN_MspInit;
        break;

      case DAL_CAN_MSPDEINIT_CB_ID :
        hcan->MspDeInitCallback = DAL_CAN_MspDeInit;
        break;

      default :
        /* Update the error code */
        hcan->ErrorCode |= DAL_CAN_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (hcan->State == DAL_CAN_STATE_RESET)
  {
    switch (CallbackID)
    {
      case DAL_CAN_MSPINIT_CB_ID :
        hcan->MspInitCallback = DAL_CAN_MspInit;
        break;

      case DAL_CAN_MSPDEINIT_CB_ID :
        hcan->MspDeInitCallback = DAL_CAN_MspDeInit;
        break;

      default :
        /* Update the error code */
        hcan->ErrorCode |= DAL_CAN_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hcan->ErrorCode |= DAL_CAN_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  DAL_ERROR;
  }

  return status;
}
#endif /* USE_DAL_CAN_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup CAN_Exported_Functions_Group2 Configuration functions
 *  @brief    Configuration functions.
 *
@verbatim
  ==============================================================================
              ##### Configuration functions #####
  ==============================================================================
    [..]  This section provides functions allowing to:
      (+) DAL_CAN_ConfigFilter            : Configure the CAN reception filters

@endverbatim
  * @{
  */

/**
  * @brief  Configures the CAN reception filter according to the specified
  *         parameters in the CAN_FilterInitStruct.
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  sFilterConfig pointer to a CAN_FilterTypeDef structure that
  *         contains the filter configuration information.
  * @retval None
  */
DAL_StatusTypeDef DAL_CAN_ConfigFilter(CAN_HandleTypeDef *hcan, CAN_FilterTypeDef *sFilterConfig)
{
  uint32_t filternbrbitpos;
  CAN_TypeDef *can_ip = hcan->Instance;
  DAL_CAN_StateTypeDef state = hcan->State;

  if ((state == DAL_CAN_STATE_READY) ||
      (state == DAL_CAN_STATE_LISTENING))
  {
    /* Check the parameters */
    ASSERT_PARAM(IS_CAN_FILTER_ID_HALFWORD(sFilterConfig->FilterIdHigh));
    ASSERT_PARAM(IS_CAN_FILTER_ID_HALFWORD(sFilterConfig->FilterIdLow));
    ASSERT_PARAM(IS_CAN_FILTER_ID_HALFWORD(sFilterConfig->FilterMaskIdHigh));
    ASSERT_PARAM(IS_CAN_FILTER_ID_HALFWORD(sFilterConfig->FilterMaskIdLow));
    ASSERT_PARAM(IS_CAN_FILTER_MODE(sFilterConfig->FilterMode));
    ASSERT_PARAM(IS_CAN_FILTER_SCALE(sFilterConfig->FilterScale));
    ASSERT_PARAM(IS_CAN_FILTER_FIFO(sFilterConfig->FilterFIFOAssignment));
    ASSERT_PARAM(IS_CAN_FILTER_ACTIVATION(sFilterConfig->FilterActivation));

#if defined(CAN3)
    /* Check the CAN instance */
    if (hcan->Instance == CAN3)
    {
      /* CAN3 is single instance with 14 dedicated filters banks */

      /* Check the parameters */
      ASSERT_PARAM(IS_CAN_FILTER_BANK_SINGLE(sFilterConfig->FilterBank));
    }
    else
    {
      /* CAN1 and CAN2 are dual instances with 28 common filters banks */
      /* Select master instance to access the filter banks */
      can_ip = CAN1;

      /* Check the parameters */
      ASSERT_PARAM(IS_CAN_FILTER_BANK_DUAL(sFilterConfig->FilterBank));
      ASSERT_PARAM(IS_CAN_FILTER_BANK_DUAL(sFilterConfig->SlaveStartFilterBank));
    }
#elif defined(CAN2)
    /* CAN1 and CAN2 are dual instances with 28 common filters banks */
    /* Select master instance to access the filter banks */
    can_ip = CAN1;

    /* Check the parameters */
    ASSERT_PARAM(IS_CAN_FILTER_BANK_DUAL(sFilterConfig->FilterBank));
    ASSERT_PARAM(IS_CAN_FILTER_BANK_DUAL(sFilterConfig->SlaveStartFilterBank));
#else
    /* CAN1 is single instance with 14 dedicated filters banks */

    /* Check the parameters */
    ASSERT_PARAM(IS_CAN_FILTER_BANK_SINGLE(sFilterConfig->FilterBank));
#endif

    /* Initialisation mode for the filter */
    SET_BIT(can_ip->FCTRL, CAN_FCTRL_FINITEN);

#if defined(CAN3)
    /* Check the CAN instance */
    if (can_ip == CAN1)
    {
      /* Select the start filter number of CAN2 slave instance */
      CLEAR_BIT(can_ip->FCTRL, CAN_FCTRL_CAN2SB);
      SET_BIT(can_ip->FCTRL, sFilterConfig->SlaveStartFilterBank << CAN_FCTRL_CAN2SB_Pos);
    }

#elif defined(CAN2)
    /* Select the start filter number of CAN2 slave instance */
    CLEAR_BIT(can_ip->FCTRL, CAN_FCTRL_CAN2SB);
    SET_BIT(can_ip->FCTRL, sFilterConfig->SlaveStartFilterBank << CAN_FCTRL_CAN2SB_Pos);

#endif
    /* Convert filter number into bit position */
    filternbrbitpos = (uint32_t)1 << (sFilterConfig->FilterBank & 0x1FU);

    /* Filter Deactivation */
    CLEAR_BIT(can_ip->FACT, filternbrbitpos);

    /* Filter Scale */
    if (sFilterConfig->FilterScale == CAN_FILTERSCALE_16BIT)
    {
      /* 16-bit scale for the filter */
      CLEAR_BIT(can_ip->FSCFG, filternbrbitpos);

      /* First 16-bit identifier and First 16-bit mask */
      /* Or First 16-bit identifier and Second 16-bit identifier */
      can_ip->sFilterRegister[sFilterConfig->FilterBank].FBANK1 =
        ((0x0000FFFFU & (uint32_t)sFilterConfig->FilterMaskIdLow) << 16U) |
        (0x0000FFFFU & (uint32_t)sFilterConfig->FilterIdLow);

      /* Second 16-bit identifier and Second 16-bit mask */
      /* Or Third 16-bit identifier and Fourth 16-bit identifier */
      can_ip->sFilterRegister[sFilterConfig->FilterBank].FBANK2 =
        ((0x0000FFFFU & (uint32_t)sFilterConfig->FilterMaskIdHigh) << 16U) |
        (0x0000FFFFU & (uint32_t)sFilterConfig->FilterIdHigh);
    }

    if (sFilterConfig->FilterScale == CAN_FILTERSCALE_32BIT)
    {
      /* 32-bit scale for the filter */
      SET_BIT(can_ip->FSCFG, filternbrbitpos);

      /* 32-bit identifier or First 32-bit identifier */
      can_ip->sFilterRegister[sFilterConfig->FilterBank].FBANK1 =
        ((0x0000FFFFU & (uint32_t)sFilterConfig->FilterIdHigh) << 16U) |
        (0x0000FFFFU & (uint32_t)sFilterConfig->FilterIdLow);

      /* 32-bit mask or Second 32-bit identifier */
      can_ip->sFilterRegister[sFilterConfig->FilterBank].FBANK2 =
        ((0x0000FFFFU & (uint32_t)sFilterConfig->FilterMaskIdHigh) << 16U) |
        (0x0000FFFFU & (uint32_t)sFilterConfig->FilterMaskIdLow);
    }

    /* Filter Mode */
    if (sFilterConfig->FilterMode == CAN_FILTERMODE_IDMASK)
    {
      /* Id/Mask mode for the filter*/
      CLEAR_BIT(can_ip->FMCFG, filternbrbitpos);
    }
    else /* CAN_FilterInitStruct->CAN_FilterMode == CAN_FilterMode_IdList */
    {
      /* Identifier list mode for the filter*/
      SET_BIT(can_ip->FMCFG, filternbrbitpos);
    }

    /* Filter FIFO assignment */
    if (sFilterConfig->FilterFIFOAssignment == CAN_FILTER_FIFO0)
    {
      /* FIFO 0 assignation for the filter */
      CLEAR_BIT(can_ip->FFASS, filternbrbitpos);
    }
    else
    {
      /* FIFO 1 assignation for the filter */
      SET_BIT(can_ip->FFASS, filternbrbitpos);
    }

    /* Filter activation */
    if (sFilterConfig->FilterActivation == CAN_FILTER_ENABLE)
    {
      SET_BIT(can_ip->FACT, filternbrbitpos);
    }

    /* Leave the initialisation mode for the filter */
    CLEAR_BIT(can_ip->FCTRL, CAN_FCTRL_FINITEN);

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= DAL_CAN_ERROR_NOT_INITIALIZED;

    return DAL_ERROR;
  }
}

/**
  * @}
  */

/** @defgroup CAN_Exported_Functions_Group3 Control functions
 *  @brief    Control functions
 *
@verbatim
  ==============================================================================
                      ##### Control functions #####
  ==============================================================================
    [..]  This section provides functions allowing to:
      (+) DAL_CAN_Start                    : Start the CAN module
      (+) DAL_CAN_Stop                     : Stop the CAN module
      (+) DAL_CAN_RequestSleep             : Request sleep mode entry.
      (+) DAL_CAN_WakeUp                   : Wake up from sleep mode.
      (+) DAL_CAN_IsSleepActive            : Check is sleep mode is active.
      (+) DAL_CAN_AddTxMessage             : Add a message to the Tx mailboxes
                                             and activate the corresponding
                                             transmission request
      (+) DAL_CAN_AbortTxRequest           : Abort transmission request
      (+) DAL_CAN_GetTxMailboxesFreeLevel  : Return Tx mailboxes free level
      (+) DAL_CAN_IsTxMessagePending       : Check if a transmission request is
                                             pending on the selected Tx mailbox
      (+) DAL_CAN_GetRxMessage             : Get a CAN frame from the Rx FIFO
      (+) DAL_CAN_GetRxFifoFillLevel       : Return Rx FIFO fill level

@endverbatim
  * @{
  */

/**
  * @brief  Start the CAN module.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_CAN_Start(CAN_HandleTypeDef *hcan)
{
  uint32_t tickstart;

