betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_can.c
  if (hcan->State == DAL_CAN_STATE_READY)
  {
    /* Change CAN peripheral state */
    hcan->State = DAL_CAN_STATE_LISTENING;

    /* Request leave initialisation */
    CLEAR_BIT(hcan->Instance->MCTRL, CAN_MCTRL_INITREQ);

    /* Get tick */
    tickstart = DAL_GetTick();

    /* Wait the acknowledge */
    while ((hcan->Instance->MSTS & CAN_MSTS_INITFLG) != 0U)
    {
      /* Check for the Timeout */
      if ((DAL_GetTick() - tickstart) > CAN_TIMEOUT_VALUE)
      {
        /* Update error code */
        hcan->ErrorCode |= DAL_CAN_ERROR_TIMEOUT;

        /* Change CAN state */
        hcan->State = DAL_CAN_STATE_ERROR;

        return DAL_ERROR;
      }
    }

    /* Reset the CAN ErrorCode */
    hcan->ErrorCode = DAL_CAN_ERROR_NONE;

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= DAL_CAN_ERROR_NOT_READY;

    return DAL_ERROR;
  }
}

/**
  * @brief  Stop the CAN module and enable access to configuration registers.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_CAN_Stop(CAN_HandleTypeDef *hcan)
{
  uint32_t tickstart;

  if (hcan->State == DAL_CAN_STATE_LISTENING)
  {
    /* Request initialisation */
    SET_BIT(hcan->Instance->MCTRL, CAN_MCTRL_INITREQ);

    /* Get tick */
    tickstart = DAL_GetTick();

    /* Wait the acknowledge */
    while ((hcan->Instance->MSTS & CAN_MSTS_INITFLG) == 0U)
    {
      /* Check for the Timeout */
      if ((DAL_GetTick() - tickstart) > CAN_TIMEOUT_VALUE)
      {
        /* Update error code */
        hcan->ErrorCode |= DAL_CAN_ERROR_TIMEOUT;

        /* Change CAN state */
        hcan->State = DAL_CAN_STATE_ERROR;

        return DAL_ERROR;
      }
    }

    /* Exit from sleep mode */
    CLEAR_BIT(hcan->Instance->MCTRL, CAN_MCTRL_SLEEPREQ);

    /* Change CAN peripheral state */
    hcan->State = DAL_CAN_STATE_READY;

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= DAL_CAN_ERROR_NOT_STARTED;

    return DAL_ERROR;
  }
}

/**
  * @brief  Request the sleep mode (low power) entry.
  *         When returning from this function, Sleep mode will be entered
  *         as soon as the current CAN activity (transmission or reception
  *         of a CAN frame) has been completed.
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval DAL status.
  */
DAL_StatusTypeDef DAL_CAN_RequestSleep(CAN_HandleTypeDef *hcan)
{
  DAL_CAN_StateTypeDef state = hcan->State;

  if ((state == DAL_CAN_STATE_READY) ||
      (state == DAL_CAN_STATE_LISTENING))
  {
    /* Request Sleep mode */
    SET_BIT(hcan->Instance->MCTRL, CAN_MCTRL_SLEEPREQ);

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= DAL_CAN_ERROR_NOT_INITIALIZED;

    /* Return function status */
    return DAL_ERROR;
  }
}

/**
  * @brief  Wake up from sleep mode.
  *         When returning with DAL_OK status from this function, Sleep mode
  *         is exited.
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval DAL status.
  */
DAL_StatusTypeDef DAL_CAN_WakeUp(CAN_HandleTypeDef *hcan)
{
  __IO uint32_t count = 0;
  uint32_t timeout = 1000000U;
  DAL_CAN_StateTypeDef state = hcan->State;

  if ((state == DAL_CAN_STATE_READY) ||
      (state == DAL_CAN_STATE_LISTENING))
  {
    /* Wake up request */
    CLEAR_BIT(hcan->Instance->MCTRL, CAN_MCTRL_SLEEPREQ);

    /* Wait sleep mode is exited */
    do
    {
      /* Increment counter */
      count++;

      /* Check if timeout is reached */
      if (count > timeout)
      {
        /* Update error code */
        hcan->ErrorCode |= DAL_CAN_ERROR_TIMEOUT;

        return DAL_ERROR;
      }
    }
    while ((hcan->Instance->MSTS & CAN_MSTS_SLEEPFLG) != 0U);

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= DAL_CAN_ERROR_NOT_INITIALIZED;

    return DAL_ERROR;
  }
}

/**
  * @brief  Check is sleep mode is active.
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval Status
  *          - 0 : Sleep mode is not active.
  *          - 1 : Sleep mode is active.
  */
uint32_t DAL_CAN_IsSleepActive(CAN_HandleTypeDef *hcan)
{
  uint32_t status = 0U;
  DAL_CAN_StateTypeDef state = hcan->State;

  if ((state == DAL_CAN_STATE_READY) ||
      (state == DAL_CAN_STATE_LISTENING))
  {
    /* Check Sleep mode */
    if ((hcan->Instance->MSTS & CAN_MSTS_SLEEPFLG) != 0U)
    {
      status = 1U;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Add a message to the first free Tx mailbox and activate the
  *         corresponding transmission request.
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  pHeader pointer to a CAN_TxHeaderTypeDef structure.
  * @param  aData array containing the payload of the Tx frame.
  * @param  pTxMailbox pointer to a variable where the function will return
  *         the TxMailbox used to store the Tx message.
  *         This parameter can be a value of @arg CAN_Tx_Mailboxes.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_CAN_AddTxMessage(CAN_HandleTypeDef *hcan, CAN_TxHeaderTypeDef *pHeader, uint8_t aData[], uint32_t *pTxMailbox)
{
  uint32_t transmitmailbox;
  DAL_CAN_StateTypeDef state = hcan->State;
  uint32_t TXSTS = READ_REG(hcan->Instance->TXSTS);

  /* Check the parameters */
  ASSERT_PARAM(IS_CAN_IDTYPE(pHeader->IDE));
  ASSERT_PARAM(IS_CAN_RTR(pHeader->RTR));
  ASSERT_PARAM(IS_CAN_DLC(pHeader->DLC));
  if (pHeader->IDE == CAN_ID_STD)
  {
    ASSERT_PARAM(IS_CAN_STDID(pHeader->StdId));
  }
  else
  {
    ASSERT_PARAM(IS_CAN_EXTID(pHeader->ExtId));
  }
  ASSERT_PARAM(IS_FUNCTIONAL_STATE(pHeader->TransmitGlobalTime));

