betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_can.c
  if ((state == DAL_CAN_STATE_READY) ||
      (state == DAL_CAN_STATE_LISTENING))
  {
    /* Check that all the Tx mailboxes are not full */
    if (((TXSTS & CAN_TXSTS_TXMEFLG0) != 0U) ||
        ((TXSTS & CAN_TXSTS_TXMEFLG1) != 0U) ||
        ((TXSTS & CAN_TXSTS_TXMEFLG2) != 0U))
    {
      /* Select an empty transmit mailbox */
      transmitmailbox = (TXSTS & CAN_TXSTS_EMNUM) >> CAN_TXSTS_EMNUM_Pos;

      /* Check transmit mailbox value */
      if (transmitmailbox > 2U)
      {
        /* Update error code */
        hcan->ErrorCode |= DAL_CAN_ERROR_INTERNAL;

        return DAL_ERROR;
      }

      /* Store the Tx mailbox */
      *pTxMailbox = (uint32_t)1 << transmitmailbox;

      /* Set up the Id */
      if (pHeader->IDE == CAN_ID_STD)
      {
        hcan->Instance->sTxMailBox[transmitmailbox].TXMID = ((pHeader->StdId << CAN_TXMID0_STDID_Pos) |
                                                           pHeader->RTR);
      }
      else
      {
        hcan->Instance->sTxMailBox[transmitmailbox].TXMID = ((pHeader->ExtId << CAN_TXMID0_EXTID_Pos) |
                                                           pHeader->IDE |
                                                           pHeader->RTR);
      }

      /* Set up the DLC */
      hcan->Instance->sTxMailBox[transmitmailbox].TXDLEN = (pHeader->DLC);

      /* Set up the Transmit Global Time mode */
      if (pHeader->TransmitGlobalTime == ENABLE)
      {
        SET_BIT(hcan->Instance->sTxMailBox[transmitmailbox].TXDLEN, CAN_TXDLEN0_TXTS);
      }

      /* Set up the data field */
      WRITE_REG(hcan->Instance->sTxMailBox[transmitmailbox].TXMDH,
                ((uint32_t)aData[7] << CAN_TXMDH0_DATABYTE7_Pos) |
                ((uint32_t)aData[6] << CAN_TXMDH0_DATABYTE6_Pos) |
                ((uint32_t)aData[5] << CAN_TXMDH0_DATABYTE5_Pos) |
                ((uint32_t)aData[4] << CAN_TXMDH0_DATABYTE4_Pos));
      WRITE_REG(hcan->Instance->sTxMailBox[transmitmailbox].TXMDL,
                ((uint32_t)aData[3] << CAN_TXMDL0_DATABYTE3_Pos) |
                ((uint32_t)aData[2] << CAN_TXMDL0_DATABYTE2_Pos) |
                ((uint32_t)aData[1] << CAN_TXMDL0_DATABYTE1_Pos) |
                ((uint32_t)aData[0] << CAN_TXMDL0_DATABYTE0_Pos));

      /* Request transmission */
      SET_BIT(hcan->Instance->sTxMailBox[transmitmailbox].TXMID, CAN_TXMID0_TXMREQ);

      /* Return function status */
      return DAL_OK;
    }
    else
    {
      /* Update error code */
      hcan->ErrorCode |= DAL_CAN_ERROR_PARAM;

      return DAL_ERROR;
    }
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= DAL_CAN_ERROR_NOT_INITIALIZED;

    return DAL_ERROR;
  }
}

/**
  * @brief  Abort transmission requests
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  TxMailboxes List of the Tx Mailboxes to abort.
  *         This parameter can be any combination of @arg CAN_Tx_Mailboxes.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_CAN_AbortTxRequest(CAN_HandleTypeDef *hcan, uint32_t TxMailboxes)
{
  DAL_CAN_StateTypeDef state = hcan->State;

  /* Check function parameters */
  ASSERT_PARAM(IS_CAN_TX_MAILBOX_LIST(TxMailboxes));

  if ((state == DAL_CAN_STATE_READY) ||
      (state == DAL_CAN_STATE_LISTENING))
  {
    /* Check Tx Mailbox 0 */
    if ((TxMailboxes & CAN_TX_MAILBOX0) != 0U)
    {
      /* Add cancellation request for Tx Mailbox 0 */
      SET_BIT(hcan->Instance->TXSTS, CAN_TXSTS_ABREQFLG0);
    }

    /* Check Tx Mailbox 1 */
    if ((TxMailboxes & CAN_TX_MAILBOX1) != 0U)
    {
      /* Add cancellation request for Tx Mailbox 1 */
      SET_BIT(hcan->Instance->TXSTS, CAN_TXSTS_ABREQFLG1);
    }

    /* Check Tx Mailbox 2 */
    if ((TxMailboxes & CAN_TX_MAILBOX2) != 0U)
    {
      /* Add cancellation request for Tx Mailbox 2 */
      SET_BIT(hcan->Instance->TXSTS, CAN_TXSTS_ABREQFLG2);
    }

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= DAL_CAN_ERROR_NOT_INITIALIZED;

    return DAL_ERROR;
  }
}

/**
  * @brief  Return Tx Mailboxes free level: number of free Tx Mailboxes.
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval Number of free Tx Mailboxes.
  */
uint32_t DAL_CAN_GetTxMailboxesFreeLevel(CAN_HandleTypeDef *hcan)
{
  uint32_t freelevel = 0U;
  DAL_CAN_StateTypeDef state = hcan->State;

  if ((state == DAL_CAN_STATE_READY) ||
      (state == DAL_CAN_STATE_LISTENING))
  {
    /* Check Tx Mailbox 0 status */
    if ((hcan->Instance->TXSTS & CAN_TXSTS_TXMEFLG0) != 0U)
    {
      freelevel++;
    }

    /* Check Tx Mailbox 1 status */
    if ((hcan->Instance->TXSTS & CAN_TXSTS_TXMEFLG1) != 0U)
    {
      freelevel++;
    }

    /* Check Tx Mailbox 2 status */
    if ((hcan->Instance->TXSTS & CAN_TXSTS_TXMEFLG2) != 0U)
    {
      freelevel++;
    }
  }

  /* Return Tx Mailboxes free level */
  return freelevel;
}

/**
  * @brief  Check if a transmission request is pending on the selected Tx
  *         Mailboxes.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  TxMailboxes List of Tx Mailboxes to check.
  *         This parameter can be any combination of @arg CAN_Tx_Mailboxes.
  * @retval Status
  *          - 0 : No pending transmission request on any selected Tx Mailboxes.
  *          - 1 : Pending transmission request on at least one of the selected
  *                Tx Mailbox.
  */
uint32_t DAL_CAN_IsTxMessagePending(CAN_HandleTypeDef *hcan, uint32_t TxMailboxes)
{
  uint32_t status = 0U;
  DAL_CAN_StateTypeDef state = hcan->State;

  /* Check function parameters */
  ASSERT_PARAM(IS_CAN_TX_MAILBOX_LIST(TxMailboxes));

  if ((state == DAL_CAN_STATE_READY) ||
      (state == DAL_CAN_STATE_LISTENING))
  {
    /* Check pending transmission request on the selected Tx Mailboxes */
    if ((hcan->Instance->TXSTS & (TxMailboxes << CAN_TXSTS_TXMEFLG0_Pos)) != (TxMailboxes << CAN_TXSTS_TXMEFLG0_Pos))
    {
      status = 1U;
    }
  }

  /* Return status */
  return status;
}

/**
  * @brief  Return timestamp of Tx message sent, if time triggered communication
            mode is enabled.
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  TxMailbox Tx Mailbox where the timestamp of message sent will be
  *         read.
  *         This parameter can be one value of @arg CAN_Tx_Mailboxes.
  * @retval Timestamp of message sent from Tx Mailbox.
  */
uint32_t DAL_CAN_GetTxTimestamp(CAN_HandleTypeDef *hcan, uint32_t TxMailbox)
{
  uint32_t timestamp = 0U;
  uint32_t transmitmailbox;
  DAL_CAN_StateTypeDef state = hcan->State;

  /* Check function parameters */
  ASSERT_PARAM(IS_CAN_TX_MAILBOX(TxMailbox));

