betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_can.c
  if ((state == DAL_CAN_STATE_READY) ||
      (state == DAL_CAN_STATE_LISTENING))
  {
    /* Select the Tx mailbox */
    transmitmailbox = POSITION_VAL(TxMailbox);

    /* Get timestamp */
    timestamp = (hcan->Instance->sTxMailBox[transmitmailbox].TXDLEN & CAN_TXDLEN0_MTS) >> CAN_TXDLEN0_MTS_Pos;
  }

  /* Return the timestamp */
  return timestamp;
}

/**
  * @brief  Get an CAN frame from the Rx FIFO zone into the message RAM.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  RxFifo Fifo number of the received message to be read.
  *         This parameter can be a value of @arg CAN_receive_FIFO_number.
  * @param  pHeader pointer to a CAN_RxHeaderTypeDef structure where the header
  *         of the Rx frame will be stored.
  * @param  aData array where the payload of the Rx frame will be stored.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_CAN_GetRxMessage(CAN_HandleTypeDef *hcan, uint32_t RxFifo, CAN_RxHeaderTypeDef *pHeader, uint8_t aData[])
{
  DAL_CAN_StateTypeDef state = hcan->State;

  ASSERT_PARAM(IS_CAN_RX_FIFO(RxFifo));

  if ((state == DAL_CAN_STATE_READY) ||
      (state == DAL_CAN_STATE_LISTENING))
  {
    /* Check the Rx FIFO */
    if (RxFifo == CAN_RX_FIFO0) /* Rx element is assigned to Rx FIFO 0 */
    {
      /* Check that the Rx FIFO 0 is not empty */
      if ((hcan->Instance->RXF0 & CAN_RXF0_FMNUM0) == 0U)
      {
        /* Update error code */
        hcan->ErrorCode |= DAL_CAN_ERROR_PARAM;

        return DAL_ERROR;
      }
    }
    else /* Rx element is assigned to Rx FIFO 1 */
    {
      /* Check that the Rx FIFO 1 is not empty */
      if ((hcan->Instance->RXF1 & CAN_RXF1_FMNUM1) == 0U)
      {
        /* Update error code */
        hcan->ErrorCode |= DAL_CAN_ERROR_PARAM;

        return DAL_ERROR;
      }
    }

    /* Get the header */
    pHeader->IDE = CAN_RXMID0_IDTYPESEL & hcan->Instance->sFIFOMailBox[RxFifo].RXMID;
    if (pHeader->IDE == CAN_ID_STD)
    {
      pHeader->StdId = (CAN_RXMID0_STDID & hcan->Instance->sFIFOMailBox[RxFifo].RXMID) >> CAN_TXMID0_STDID_Pos;
    }
    else
    {
      pHeader->ExtId = ((CAN_RXMID0_EXTID | CAN_RXMID0_STDID) & hcan->Instance->sFIFOMailBox[RxFifo].RXMID) >> CAN_RXMID0_EXTID_Pos;
    }
    pHeader->RTR = (CAN_RXMID0_RFTXREQ & hcan->Instance->sFIFOMailBox[RxFifo].RXMID);
    pHeader->DLC = (CAN_RXDLEN0_DLCODE & hcan->Instance->sFIFOMailBox[RxFifo].RXDLEN) >> CAN_RXDLEN0_DLCODE_Pos;
    pHeader->FilterMatchIndex = (CAN_RXDLEN0_FMIDX & hcan->Instance->sFIFOMailBox[RxFifo].RXDLEN) >> CAN_RXDLEN0_FMIDX_Pos;
    pHeader->Timestamp = (CAN_RXDLEN0_MTS & hcan->Instance->sFIFOMailBox[RxFifo].RXDLEN) >> CAN_RXDLEN0_MTS_Pos;

    /* Get the data */
    aData[0] = (uint8_t)((CAN_RXMDL0_DATABYTE0 & hcan->Instance->sFIFOMailBox[RxFifo].RXMDL) >> CAN_RXMDL0_DATABYTE0_Pos);
    aData[1] = (uint8_t)((CAN_RXMDL0_DATABYTE1 & hcan->Instance->sFIFOMailBox[RxFifo].RXMDL) >> CAN_RXMDL0_DATABYTE1_Pos);
    aData[2] = (uint8_t)((CAN_RXMDL0_DATABYTE2 & hcan->Instance->sFIFOMailBox[RxFifo].RXMDL) >> CAN_RXMDL0_DATABYTE2_Pos);
    aData[3] = (uint8_t)((CAN_RXMDL0_DATABYTE3 & hcan->Instance->sFIFOMailBox[RxFifo].RXMDL) >> CAN_RXMDL0_DATABYTE3_Pos);
    aData[4] = (uint8_t)((CAN_RXMDH0_DATABYTE4 & hcan->Instance->sFIFOMailBox[RxFifo].RXMDH) >> CAN_RXMDH0_DATABYTE4_Pos);
    aData[5] = (uint8_t)((CAN_RXMDH0_DATABYTE5 & hcan->Instance->sFIFOMailBox[RxFifo].RXMDH) >> CAN_RXMDH0_DATABYTE5_Pos);
    aData[6] = (uint8_t)((CAN_RXMDH0_DATABYTE6 & hcan->Instance->sFIFOMailBox[RxFifo].RXMDH) >> CAN_RXMDH0_DATABYTE6_Pos);
    aData[7] = (uint8_t)((CAN_RXMDH0_DATABYTE7 & hcan->Instance->sFIFOMailBox[RxFifo].RXMDH) >> CAN_RXMDH0_DATABYTE7_Pos);

    /* Release the FIFO */
    if (RxFifo == CAN_RX_FIFO0) /* Rx element is assigned to Rx FIFO 0 */
    {
      /* Release RX FIFO 0 */
      SET_BIT(hcan->Instance->RXF0, CAN_RXF0_RFOM0);
    }
    else /* Rx element is assigned to Rx FIFO 1 */
    {
      /* Release RX FIFO 1 */
      SET_BIT(hcan->Instance->RXF1, CAN_RXF1_RFOM1);
    }

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= DAL_CAN_ERROR_NOT_INITIALIZED;

    return DAL_ERROR;
  }
}

/**
  * @brief  Return Rx FIFO fill level.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  RxFifo Rx FIFO.
  *         This parameter can be a value of @arg CAN_receive_FIFO_number.
  * @retval Number of messages available in Rx FIFO.
  */
uint32_t DAL_CAN_GetRxFifoFillLevel(CAN_HandleTypeDef *hcan, uint32_t RxFifo)
{
  uint32_t filllevel = 0U;
  DAL_CAN_StateTypeDef state = hcan->State;

  /* Check function parameters */
  ASSERT_PARAM(IS_CAN_RX_FIFO(RxFifo));

  if ((state == DAL_CAN_STATE_READY) ||
      (state == DAL_CAN_STATE_LISTENING))
  {
    if (RxFifo == CAN_RX_FIFO0)
    {
      filllevel = hcan->Instance->RXF0 & CAN_RXF0_FMNUM0;
    }
    else /* RxFifo == CAN_RX_FIFO1 */
    {
      filllevel = hcan->Instance->RXF1 & CAN_RXF1_FMNUM1;
    }
  }

  /* Return Rx FIFO fill level */
  return filllevel;
}

/**
  * @}
  */

/** @defgroup CAN_Exported_Functions_Group4 Interrupts management
 *  @brief    Interrupts management
 *
@verbatim
  ==============================================================================
                       ##### Interrupts management #####
  ==============================================================================
    [..]  This section provides functions allowing to:
      (+) DAL_CAN_ActivateNotification      : Enable interrupts
      (+) DAL_CAN_DeactivateNotification    : Disable interrupts
      (+) DAL_CAN_IRQHandler                : Handles CAN interrupt request

@endverbatim
  * @{
  */

/**
  * @brief  Enable interrupts.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  ActiveITs indicates which interrupts will be enabled.
  *         This parameter can be any combination of @arg CAN_Interrupts.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_CAN_ActivateNotification(CAN_HandleTypeDef *hcan, uint32_t ActiveITs)
{
  DAL_CAN_StateTypeDef state = hcan->State;

  /* Check function parameters */
  ASSERT_PARAM(IS_CAN_IT(ActiveITs));

