betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_can.c
  if ((state == DAL_CAN_STATE_READY) ||
      (state == DAL_CAN_STATE_LISTENING))
  {
    /* Enable the selected interrupts */
    __DAL_CAN_ENABLE_IT(hcan, ActiveITs);

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= DAL_CAN_ERROR_NOT_INITIALIZED;

    return DAL_ERROR;
  }
}

/**
  * @brief  Disable interrupts.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  InactiveITs indicates which interrupts will be disabled.
  *         This parameter can be any combination of @arg CAN_Interrupts.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_CAN_DeactivateNotification(CAN_HandleTypeDef *hcan, uint32_t InactiveITs)
{
  DAL_CAN_StateTypeDef state = hcan->State;

  /* Check function parameters */
  ASSERT_PARAM(IS_CAN_IT(InactiveITs));

  if ((state == DAL_CAN_STATE_READY) ||
      (state == DAL_CAN_STATE_LISTENING))
  {
    /* Disable the selected interrupts */
    __DAL_CAN_DISABLE_IT(hcan, InactiveITs);

    /* Return function status */
    return DAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= DAL_CAN_ERROR_NOT_INITIALIZED;

    return DAL_ERROR;
  }
}

/**
  * @brief  Handles CAN interrupt request
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval None
  */
void DAL_CAN_IRQHandler(CAN_HandleTypeDef *hcan)
{
  uint32_t errorcode = DAL_CAN_ERROR_NONE;
  uint32_t interrupts = READ_REG(hcan->Instance->INTEN);
  uint32_t MSTSflags = READ_REG(hcan->Instance->MSTS);
  uint32_t TXSTSflags = READ_REG(hcan->Instance->TXSTS);
  uint32_t RXF0flags = READ_REG(hcan->Instance->RXF0);
  uint32_t RXF1flags = READ_REG(hcan->Instance->RXF1);
  uint32_t esrflags = READ_REG(hcan->Instance->ERRSTS);

  /* Transmit Mailbox empty interrupt management *****************************/
  if ((interrupts & CAN_IT_TX_MAILBOX_EMPTY) != 0U)
  {
    /* Transmit Mailbox 0 management *****************************************/
    if ((TXSTSflags & CAN_TXSTS_REQCFLG0) != 0U)
    {
      /* Clear the Transmission Complete flag (and TXOK0,ALST0,TERR0 bits) */
      __DAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_RQCP0);

      if ((TXSTSflags & CAN_TXSTS_TXSUSFLG0) != 0U)
      {
        /* Transmission Mailbox 0 complete callback */
#if USE_DAL_CAN_REGISTER_CALLBACKS == 1
        /* Call registered callback*/
        hcan->TxMailbox0CompleteCallback(hcan);
#else
        /* Call weak (surcharged) callback */
        DAL_CAN_TxMailbox0CompleteCallback(hcan);
#endif /* USE_DAL_CAN_REGISTER_CALLBACKS */
      }
      else
      {
        if ((TXSTSflags & CAN_TXSTS_ARBLSTFLG0) != 0U)
        {
          /* Update error code */
          errorcode |= DAL_CAN_ERROR_TX_ALST0;
        }
        else if ((TXSTSflags & CAN_TXSTS_TXERRFLG0) != 0U)
        {
          /* Update error code */
          errorcode |= DAL_CAN_ERROR_TX_TERR0;
        }
        else
        {
          /* Transmission Mailbox 0 abort callback */
#if USE_DAL_CAN_REGISTER_CALLBACKS == 1
          /* Call registered callback*/
          hcan->TxMailbox0AbortCallback(hcan);
#else
          /* Call weak (surcharged) callback */
          DAL_CAN_TxMailbox0AbortCallback(hcan);
#endif /* USE_DAL_CAN_REGISTER_CALLBACKS */
        }
      }
    }

    /* Transmit Mailbox 1 management *****************************************/
    if ((TXSTSflags & CAN_TXSTS_REQCFLG1) != 0U)
    {
      /* Clear the Transmission Complete flag (and TXOK1,ALST1,TERR1 bits) */
      __DAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_RQCP1);

      if ((TXSTSflags & CAN_TXSTS_TXSUSFLG1) != 0U)
      {
        /* Transmission Mailbox 1 complete callback */
#if USE_DAL_CAN_REGISTER_CALLBACKS == 1
        /* Call registered callback*/
        hcan->TxMailbox1CompleteCallback(hcan);
#else
        /* Call weak (surcharged) callback */
        DAL_CAN_TxMailbox1CompleteCallback(hcan);
#endif /* USE_DAL_CAN_REGISTER_CALLBACKS */
      }
      else
      {
        if ((TXSTSflags & CAN_TXSTS_ARBLSTFLG1) != 0U)
        {
          /* Update error code */
          errorcode |= DAL_CAN_ERROR_TX_ALST1;
        }
        else if ((TXSTSflags & CAN_TXSTS_TXERRFLG1) != 0U)
        {
          /* Update error code */
          errorcode |= DAL_CAN_ERROR_TX_TERR1;
        }
        else
        {
          /* Transmission Mailbox 1 abort callback */
#if USE_DAL_CAN_REGISTER_CALLBACKS == 1
          /* Call registered callback*/
          hcan->TxMailbox1AbortCallback(hcan);
#else
          /* Call weak (surcharged) callback */
          DAL_CAN_TxMailbox1AbortCallback(hcan);
#endif /* USE_DAL_CAN_REGISTER_CALLBACKS */
        }
      }
    }

    /* Transmit Mailbox 2 management *****************************************/
    if ((TXSTSflags & CAN_TXSTS_REQCFLG2) != 0U)
    {
      /* Clear the Transmission Complete flag (and TXOK2,ALST2,TERR2 bits) */
      __DAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_RQCP2);

      if ((TXSTSflags & CAN_TXSTS_TXSUSFLG2) != 0U)
      {
        /* Transmission Mailbox 2 complete callback */
#if USE_DAL_CAN_REGISTER_CALLBACKS == 1
        /* Call registered callback*/
        hcan->TxMailbox2CompleteCallback(hcan);
#else
        /* Call weak (surcharged) callback */
        DAL_CAN_TxMailbox2CompleteCallback(hcan);
#endif /* USE_DAL_CAN_REGISTER_CALLBACKS */
      }
      else
      {
        if ((TXSTSflags & CAN_TXSTS_ARBLSTFLG2) != 0U)
        {
          /* Update error code */
          errorcode |= DAL_CAN_ERROR_TX_ALST2;
        }
        else if ((TXSTSflags & CAN_TXSTS_TXERRFLG2) != 0U)
        {
          /* Update error code */
          errorcode |= DAL_CAN_ERROR_TX_TERR2;
        }
        else
        {
          /* Transmission Mailbox 2 abort callback */
#if USE_DAL_CAN_REGISTER_CALLBACKS == 1
          /* Call registered callback*/
          hcan->TxMailbox2AbortCallback(hcan);
#else
          /* Call weak (surcharged) callback */
          DAL_CAN_TxMailbox2AbortCallback(hcan);
#endif /* USE_DAL_CAN_REGISTER_CALLBACKS */
        }
      }
    }
  }

  /* Receive FIFO 0 overrun interrupt management *****************************/
  if ((interrupts & CAN_IT_RX_FIFO0_OVERRUN) != 0U)
  {
    if ((RXF0flags & CAN_RXF0_FOVRFLG0) != 0U)
    {
      /* Set CAN error code to Rx Fifo 0 overrun error */
      errorcode |= DAL_CAN_ERROR_RX_FOV0;

      /* Clear FIFO0 Overrun Flag */
      __DAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_FOV0);
    }
  }

  /* Receive FIFO 0 full interrupt management ********************************/
  if ((interrupts & CAN_IT_RX_FIFO0_FULL) != 0U)
  {
    if ((RXF0flags & CAN_RXF0_FFULLFLG0) != 0U)
    {
      /* Clear FIFO 0 full Flag */
      __DAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_FF0);

      /* Receive FIFO 0 full Callback */
#if USE_DAL_CAN_REGISTER_CALLBACKS == 1
      /* Call registered callback*/
      hcan->RxFifo0FullCallback(hcan);
#else
      /* Call weak (surcharged) callback */
      DAL_CAN_RxFifo0FullCallback(hcan);
#endif /* USE_DAL_CAN_REGISTER_CALLBACKS */
    }
  }

  /* Receive FIFO 0 message pending interrupt management *********************/
  if ((interrupts & CAN_IT_RX_FIFO0_MSG_PENDING) != 0U)
  {
    /* Check if message is still pending */
    if ((hcan->Instance->RXF0 & CAN_RXF0_FMNUM0) != 0U)
    {
      /* Receive FIFO 0 message pending Callback */
#if USE_DAL_CAN_REGISTER_CALLBACKS == 1
      /* Call registered callback*/
      hcan->RxFifo0MsgPendingCallback(hcan);
#else
      /* Call weak (surcharged) callback */
      DAL_CAN_RxFifo0MsgPendingCallback(hcan);
#endif /* USE_DAL_CAN_REGISTER_CALLBACKS */
    }
  }

  /* Receive FIFO 1 overrun interrupt management *****************************/
  if ((interrupts & CAN_IT_RX_FIFO1_OVERRUN) != 0U)
  {
    if ((RXF1flags & CAN_RXF1_FOVRFLG1) != 0U)
    {
      /* Set CAN error code to Rx Fifo 1 overrun error */
      errorcode |= DAL_CAN_ERROR_RX_FOV1;

      /* Clear FIFO1 Overrun Flag */
      __DAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_FOV1);
    }
  }

