betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_can.c
  if ((state == DAL_CAN_STATE_READY) ||
      (state == DAL_CAN_STATE_LISTENING))
  {
    /* Check sleep mode acknowledge flag */
    if ((hcan->Instance->MSTS & CAN_MSTS_SLEEPFLG) != 0U)
    {
      /* Sleep mode is active */
      state = DAL_CAN_STATE_SLEEP_ACTIVE;
    }
    /* Check sleep mode request flag */
    else if ((hcan->Instance->MCTRL & CAN_MCTRL_SLEEPREQ) != 0U)
    {
      /* Sleep mode request is pending */
      state = DAL_CAN_STATE_SLEEP_PENDING;
    }
    else
    {
      /* Neither sleep mode request nor sleep mode acknowledge */
    }
  }

  /* Return CAN state */
  return state;
}

/**
  * @brief  Return the CAN error code.
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval CAN Error Code
  */
uint32_t DAL_CAN_GetError(CAN_HandleTypeDef *hcan)
{
  /* Return CAN error code */
  return hcan->ErrorCode;
}

/**
  * @brief  Reset the CAN error code.
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_CAN_ResetError(CAN_HandleTypeDef *hcan)
{
  DAL_StatusTypeDef status = DAL_OK;
  DAL_CAN_StateTypeDef state = hcan->State;

  if ((state == DAL_CAN_STATE_READY) ||
      (state == DAL_CAN_STATE_LISTENING))
  {
    /* Reset CAN error code */
    hcan->ErrorCode = 0U;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= DAL_CAN_ERROR_NOT_INITIALIZED;

    status = DAL_ERROR;
  }

  /* Return the status */
  return status;
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* DAL_CAN_MODULE_ENABLED */

/**
  * @}
  */

#endif /* CAN1 */

/**
  * @}
  */
